Revit 2022 API
ExternalDefinitionCreationOptions.Type Property
 The type of the parameter definition to be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetDataType() and SetDataType(ForgeTypeId) methods instead.")]
public ParameterType Type { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetDataType() and SetDataType(ForgeTypeId) methods instead.")> _
Public Property Type As ParameterType
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetDataType() and SetDataType(ForgeTypeId) methods instead.")]
public:
property ParameterType Type {
	ParameterType get ();
	void set (ParameterType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: e cannot be Invalid or FamilyType.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace